eksperimen/VM 2 Load Tester/logs/rootless_wrk.txt
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07s   537.24ms   1.97s    58.57%
    Req/Sec    21.89     13.66    50.00     59.02%
  1117 requests in 30.07s, 186.53KB read
  Socket errors: connect 0, read 0, write 0, timeout 1047
Requests/sec:     37.14
Transfer/sec:      6.20KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04s   560.64ms   2.00s    56.34%
    Req/Sec    15.64     10.81    50.00     63.62%
  1140 requests in 30.08s, 190.37KB read
  Socket errors: connect 0, read 0, write 0, timeout 1069
Requests/sec:     37.90
Transfer/sec:      6.33KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.69s   534.27ms   2.00s    81.70%
    Req/Sec    24.25     16.63    60.00     71.48%
  1430 requests in 30.09s, 238.80KB read
  Socket errors: connect 0, read 0, write 0, timeout 1206
Requests/sec:     47.52
Transfer/sec:      7.94KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02s   557.01ms   1.95s    57.33%
    Req/Sec    17.64     11.21    50.00     60.04%
  1126 requests in 30.08s, 188.03KB read
  Socket errors: connect 0, read 0, write 0, timeout 1051
Requests/sec:     37.43
Transfer/sec:      6.25KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05s   565.71ms   1.97s    56.16%
    Req/Sec    18.87     12.89    50.00     66.41%
  1129 requests in 30.10s, 188.68KB read
  Socket errors: connect 0, read 0, write 0, timeout 1056
Requests/sec:     37.51
Transfer/sec:      6.27KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03s   559.25ms   2.00s    56.76%
    Req/Sec    16.42     11.20    50.00     58.12%
  1131 requests in 30.07s, 188.87KB read
  Socket errors: connect 0, read 0, write 0, timeout 1057
Requests/sec:     37.61
Transfer/sec:      6.28KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07s   546.41ms   1.95s    59.42%
    Req/Sec    16.54     12.67    50.00     58.93%
  1123 requests in 30.07s, 187.53KB read
  Socket errors: connect 0, read 0, write 0, timeout 1054
Requests/sec:     37.35
Transfer/sec:      6.24KB
Running 30s test @ http://192.168.56.103:5000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03s   563.02ms   2.00s    58.11%
    Req/Sec    14.18     10.03    40.00     65.46%
  1138 requests in 30.10s, 190.04KB read
  Socket errors: connect 0, read 0, write 0, timeout 1064
Requests/sec:     37.81
Transfer/sec:      6.31KB